-- phpMyAdmin SQL Dump
-- version 4.9.2
-- https://www.phpmyadmin.net/
--
-- Hôte : 127.0.0.1:3306
-- Généré le :  lun. 26 juil. 2021 à 21:20
-- Version du serveur :  10.4.10-MariaDB
-- Version de PHP :  7.3.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de données :  `schools`
--

-- --------------------------------------------------------

--
-- Structure de la table `classes`
--

DROP TABLE IF EXISTS `classes`;
CREATE TABLE IF NOT EXISTS `classes` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `num` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `nb_places_min` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `nb_places_max` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `visible` int(11) NOT NULL DEFAULT 1,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `classes`
--

INSERT INTO `classes` (`id`, `num`, `nb_places_min`, `nb_places_max`, `created_at`, `updated_at`, `visible`) VALUES
(2, 'Salle1', '42', '73', '2021-03-16 06:11:00', '2021-03-16 06:11:00', 1),
(3, 'Salle1', '20', '30', '2021-03-16 06:11:00', '2021-03-16 06:11:00', 0),
(4, 'Lotfi Ghezal', '25', '35', NULL, NULL, 0),
(5, 'Sofiane Messaoudenne', '6', '17', NULL, NULL, 0),
(6, 'nom', '25', '37', NULL, NULL, 0),
(7, 'chemin_piece', '18', '39', NULL, NULL, 0),
(8, 'SSS', '25', '35', NULL, NULL, 0),
(9, 'modalite', '25', '35', NULL, NULL, 0),
(10, 'id', '25', '35', NULL, NULL, 0),
(11, 'chemin_piece', '25', '35', NULL, NULL, 0),
(12, 'chemin_piece', '25', '35', NULL, NULL, 0),
(13, 'created_at', '25', '35', NULL, NULL, 0),
(14, 'modalite', '25', '35', NULL, NULL, 0),
(15, 'created_at', '25', '35', NULL, NULL, 0),
(16, 'created_at', '25', '35', NULL, NULL, 0),
(17, 'Salle2', '15', '24', NULL, NULL, 1),
(18, 'Salle4', '25', '35', NULL, NULL, 1),
(19, 'chemin_piece', '25', '35', NULL, NULL, 0),
(20, 'Lotfi Ghezal', '25', '35', NULL, NULL, 0),
(21, 'Sofiane Messaoudenne', '25', '35', NULL, NULL, 0),
(22, 'Lotfi Ghezal', '25', '35', NULL, NULL, 0),
(23, 'chemin_piece', '25', '35', NULL, NULL, 0),
(24, 'id', '25', '35', NULL, NULL, 0),
(25, 'Lotfi Ghezal', '25', '35', NULL, NULL, 0),
(26, 'chemin_piece', '25', '35', NULL, NULL, 0),
(27, 'modalite', '28', '35', NULL, NULL, 0),
(28, 'Salle3', '25', '35', NULL, NULL, 1),
(29, 'B2', '25', '35', NULL, NULL, 0),
(30, 'Salle5', '27', '35', NULL, NULL, 1),
(31, 'Salle6', '25', '35', NULL, NULL, 1),
(32, 'C1', '25', '35', NULL, NULL, 0),
(33, 'C3', '25', '35', NULL, NULL, 0),
(34, 'Salle7', '25', '35', NULL, NULL, 1),
(35, 'C4', '25', '35', NULL, NULL, 0),
(36, 'C2', '25', '35', NULL, NULL, 0),
(37, 'Salle8', '25', '35', NULL, NULL, 1),
(38, 'D1', '25', '35', NULL, NULL, 0),
(39, 'D2', '30', '40', NULL, NULL, 0),
(40, 'Salle9', '25', '35', NULL, NULL, 1),
(41, '', '25', '35', NULL, NULL, 0),
(42, '', '25', '35', NULL, NULL, 0),
(43, 'C5', '19', '35', NULL, NULL, 0),
(44, 'D3', '25', '38', NULL, NULL, 0),
(45, 'D4', '25', '35', NULL, NULL, 0);

-- --------------------------------------------------------

--
-- Structure de la table `ecoles`
--

DROP TABLE IF EXISTS `ecoles`;
CREATE TABLE IF NOT EXISTS `ecoles` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `nom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `GPS` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `adresse` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `tel1` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `tel2` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `desc` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `ecoles`
--

INSERT INTO `ecoles` (`id`, `nom`, `GPS`, `adresse`, `tel1`, `tel2`, `email`, `desc`, `created_at`, `updated_at`) VALUES
(1, 'Malek School', '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3197.513088871886!2d3.16728291516929!3d36.734253579962214!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x128e5392cea80e4f%3A0x6c8d5f0d60f35e72!2sMALEK%20SCHOOL!5e0!3m2!1sfr!2sdz!4v1615900056009!5m2!1sfr!2sdz\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\"></iframe>', 'Tamaris,Mohammadia', '0557015468', '0541624286', 'malek_school@gmail.com', 'Rien', NULL, NULL);

-- --------------------------------------------------------

--
-- Structure de la table `eleves`
--

DROP TABLE IF EXISTS `eleves`;
CREATE TABLE IF NOT EXISTS `eleves` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `nom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `prenom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `num_tel` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=104 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `eleves`
--

INSERT INTO `eleves` (`id`, `nom`, `prenom`, `updated_at`, `num_tel`, `created_at`) VALUES
(1, 'خراب', 'صلاح الدين', NULL, '0556768954', '2021-07-14 20:00:27'),
(2, 'خراب', 'أيمن', NULL, '0666785432', '2021-07-14 20:00:27'),
(9, 'مسعودان', 'نوفل', NULL, '0561345267', '2021-07-15 18:34:49'),
(8, 'مسعودان', 'يونس', NULL, '0558764321', '2021-07-15 18:35:59'),
(6, 'مسعودان', 'KARIM', NULL, '0561345267', '2021-07-15 18:49:24'),
(10, 'مسعودان', 'ALI-Haider', NULL, '0561345267', '2021-07-15 20:36:06'),
(3, 'مسعودان', 'Wail', NULL, '0558764321', '2021-07-15 18:50:21'),
(81, 'مسعودان', 'مداني', NULL, '0667543278', '2021-07-17 16:25:10'),
(82, 'مسعودان', 'مروان', NULL, '0541326798', '2021-07-17 16:26:01'),
(83, 'مسعودان', 'كريمو', NULL, '0776132456', '2021-07-17 16:27:34'),
(84, 'مسعودان', 'يونس', NULL, '0559543278', '2021-07-17 16:44:47'),
(85, 'مسعودان', 'خالد', NULL, '0776132411', '2021-07-17 16:50:43'),
(86, 'مسعودان', 'صفيان', NULL, '0776132456', '2021-07-19 10:32:45'),
(87, 'مسعودان', 'محمد', NULL, '0541324598', '2021-07-19 10:49:56'),
(88, 'مسعودان', 'نوفل', NULL, '0776132456', '2021-07-21 17:52:07'),
(89, 'مسعودان', 'يونس', NULL, '0667543278', '2021-07-21 17:52:41'),
(90, 'مسعودان', 'مداني', NULL, '0541326798', '2021-07-21 17:53:34'),
(91, 'مسعودان', 'نوفل', NULL, '0561345267', '2021-07-21 21:03:11'),
(92, 'مسعودان', 'مداني', NULL, '0667543278', '2021-07-21 21:14:06'),
(93, 'مسعودان', 'نوفل', NULL, '0559543278', '2021-07-21 21:38:18'),
(94, 'مسعودان', 'مداني', NULL, '0558764321', '2021-07-25 10:50:09'),
(95, 'مسعودان', 'يونس', NULL, '0559543278', '2021-07-25 10:50:33'),
(96, 'مسعودان', 'نوفل', NULL, '0561345267', '2021-07-25 10:50:58'),
(97, 'مسعودان', 'نوفل', NULL, '0561345267', '2021-07-25 11:15:25'),
(98, 'مسعودان', 'مداني', NULL, '0558764321', '2021-07-25 11:15:41'),
(99, 'مسعودان', 'يونس', NULL, '0667543278', '2021-07-25 11:16:28'),
(100, 'مسعودان', 'نوفل', NULL, '0561345267', '2021-07-25 16:03:34'),
(101, 'مسعودان', 'يونس', NULL, '0558764321', '2021-07-25 16:04:16'),
(102, 'مسعودان', 'مداني', NULL, '0559543278', '2021-07-26 19:44:51'),
(103, 'مسعودان', 'نوفل', NULL, '0541326798', '2021-07-26 19:45:17');

-- --------------------------------------------------------

--
-- Structure de la table `failed_jobs`
--

DROP TABLE IF EXISTS `failed_jobs`;
CREATE TABLE IF NOT EXISTS `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `uuid` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `connection` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `queue` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `payload` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `exception` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`) USING HASH
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `groupes`
--

DROP TABLE IF EXISTS `groupes`;
CREATE TABLE IF NOT EXISTS `groupes` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `heure_debut` time NOT NULL,
  `heure_fin` time NOT NULL,
  `pourcentage_prof` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `pourcentage_ecole` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `annee_scolaire` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `classe` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `prof` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `niveau` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `matiere` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `jour` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `visible` int(11) NOT NULL DEFAULT 1,
  `tarif` double(8,1) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `groupes`
--

INSERT INTO `groupes` (`id`, `heure_debut`, `heure_fin`, `pourcentage_prof`, `pourcentage_ecole`, `annee_scolaire`, `classe`, `prof`, `niveau`, `matiere`, `created_at`, `updated_at`, `jour`, `visible`, `tarif`) VALUES
(1, '08:00:00', '10:00:00', '55', '45', '21/22', 'Salle1', 'Salhi-ALI-Haider', '3-AS-lettre', 'Anglais', '2021-07-25 11:14:31', '2021-07-25 11:14:31', 'Vendredi', 1, 3000.0),
(2, '10:00:00', '12:00:00', '50', '50', '21/22', 'Salle1', 'Ghezal-Lotfi', '2-AS-Mathelème', 'Math', '2021-07-25 16:03:03', '2021-07-25 16:03:03', 'Vendredi', 1, 2000.0),
(3, '13:00:00', '15:00:00', '60', '40', '21/22', 'Salle1', 'Kadri-Ilyes', '1-AS-lettre', 'Arabe', '2021-07-26 19:44:03', '2021-07-26 19:44:03', 'Vendredi', 1, 2000.0);

-- --------------------------------------------------------

--
-- Structure de la table `matieres`
--

DROP TABLE IF EXISTS `matieres`;
CREATE TABLE IF NOT EXISTS `matieres` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `nom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=17 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `matieres`
--

INSERT INTO `matieres` (`id`, `nom`, `created_at`) VALUES
(1, 'Math', '2021-07-06 13:20:11'),
(2, 'Physique', '2021-07-06 13:40:53'),
(3, 'Science', '2021-07-06 13:45:22'),
(4, 'Arabe', '2021-07-06 13:45:46'),
(5, 'Français', '2021-07-06 13:45:58'),
(6, 'Anglais', '2021-07-06 13:46:13'),
(7, 'Histoire-Géo', '2021-07-06 13:46:40'),
(8, 'Informatique', '2021-07-06 13:46:56'),
(9, 'Economie', '2021-07-06 13:47:31'),
(10, 'Finance', '2021-07-06 13:47:41'),
(11, 'Droits', '2021-07-06 13:48:01'),
(12, 'Mécanique', '2021-07-06 13:48:59'),
(13, 'GP', '2021-07-06 13:49:32'),
(14, 'GC', '2021-07-06 13:49:41'),
(15, 'GE', '2021-07-06 13:49:50'),
(16, 'Développement Web', '2021-07-25 16:22:29');

-- --------------------------------------------------------

--
-- Structure de la table `migrations`
--

DROP TABLE IF EXISTS `migrations`;
CREATE TABLE IF NOT EXISTS `migrations` (
  `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT,
  `migration` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=84 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(45, '2014_10_12_000000_create_users_table', 1),
(46, '2014_10_12_100000_create_password_resets_table', 1),
(47, '2019_08_19_000000_create_failed_jobs_table', 1),
(48, '2021_03_14_102940_create_profs_table', 1),
(49, '2021_03_14_103219_create_niveaux_table', 1),
(50, '2021_03_14_103418_create_matieres_table', 1),
(51, '2021_03_14_103606_create_eleves_table', 1),
(52, '2021_03_14_104016_create_groupes_table', 1),
(53, '2021_03_14_105111_create_seances_table', 1),
(54, '2021_03_15_105111_create_classes_table', 1),
(55, '2021_03_15_105211_create_seancesEleve_table', 1),
(56, '2021_03_16_115443_create_ecoles_table', 1),
(57, '2021_03_16_163253_add_visible_to_classes_table', 2),
(58, '2021_03_18_143153_add_visible_to_profs_table', 3),
(59, '2021_03_18_144519_add_tel_to_profs_table', 4),
(60, '2021_03_18_150443_add_matiere_to_profs_table', 5),
(62, '2021_07_03_153658_add_cycle_to_niveaux_table', 6),
(63, '2021_07_03_155149_remove_nom_desc_from_niveaux', 7),
(64, '2021_07_06_110558_add_visible_to_niveaux_table', 8),
(65, '2021_07_06_130443_update_desc_type_for_matieres_table', 9),
(66, '2021_03_14_103419_create_matieres_table', 10),
(67, '2021_07_07_202943_add_lang_column_to_user', 11),
(68, '2021_07_10_110558_add_visible_to_groupes_table', 12),
(70, '2021_07_10_120458_add_jour_to_groupes_table', 13),
(71, '2021_07_10_104016_create_groupes_table', 14),
(72, '2021_07_10_120658_add_jour_to_groupes_table', 15),
(73, '2021_07_06_110558_add_visible_to_groupes_table', 16),
(74, '2021_07_14_110558_add_num_tel_to_eleves_table', 17),
(75, '2021_03_16_105211_create_seancesEleve_table', 18),
(76, '2021_03_15_105212_create_seancesEleve_table', 19),
(77, '2021_03_15_105213_create_seancesEleve_table', 20),
(78, '2021_03_14_105112_create_seances_table', 21),
(80, '2021_07_19_105314_create_PaymentGroupesEleve_table', 22),
(81, '2021_07_10_120658_add_tarif_to_groupes_table', 23),
(82, '2021_07_21_120658_add_num_mois_to_payment_groupes_eleves_table', 24),
(83, '2021_07_26_120658_add_exoneree_to_payment_groupes_eleves_table', 25);

-- --------------------------------------------------------

--
-- Structure de la table `niveaux`
--

DROP TABLE IF EXISTS `niveaux`;
CREATE TABLE IF NOT EXISTS `niveaux` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `niveau` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `filiere` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `cycle` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `visible` int(11) NOT NULL DEFAULT 1,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `niveaux`
--

INSERT INTO `niveaux` (`id`, `created_at`, `updated_at`, `niveau`, `filiere`, `cycle`, `visible`) VALUES
(1, '2021-07-03 06:14:14', NULL, '2', 'Scientifique', 'AS', 1),
(2, '2021-07-03 17:12:24', NULL, '1', 'Scientifique', 'AS', 1),
(3, NULL, NULL, '2', 'Mathelème', 'AS', 1),
(4, NULL, NULL, '2', 'Langues', 'AS', 1),
(5, NULL, NULL, '3', 'Math-technique', 'AS', 0),
(6, NULL, NULL, '1', 'lettre', 'AS', 1),
(7, NULL, NULL, '2', 'Math-technique', 'AS', 1),
(8, NULL, NULL, '2', 'lettre', 'AS', 1),
(9, NULL, NULL, '1', 'Gestion', 'AS', 0),
(10, NULL, NULL, '3', 'lettre', 'AS', 1),
(11, NULL, NULL, '3', 'Scientifique', 'AS', 1),
(12, NULL, NULL, '3', 'Mathelème', 'AS', 1),
(13, NULL, NULL, '3', 'Math-technique', 'AS', 1),
(14, NULL, NULL, '3', 'Gestion', 'AS', 1),
(15, NULL, NULL, '3', 'Gestion', 'AS', 0),
(16, NULL, NULL, '3', 'Langues', 'AS', 1),
(17, NULL, NULL, '2', 'Langues', 'AS', 0),
(18, NULL, NULL, '2', 'Gestion', 'AS', 1),
(19, NULL, NULL, '1', '------', 'AM', 1),
(20, NULL, NULL, '2', '------', 'AM', 1),
(21, NULL, NULL, '3', '------', 'AM', 1),
(22, NULL, NULL, '4', '------', 'AM', 1),
(23, NULL, NULL, '1', '------', 'AP', 1),
(24, NULL, NULL, '2', '------', 'AP', 1),
(25, NULL, NULL, '3', '------', 'AP', 1),
(26, NULL, NULL, '4', '------', 'AP', 1),
(27, NULL, NULL, '5', '------', 'AP', 1),
(28, NULL, NULL, '5', '------', 'AP', 0),
(29, NULL, NULL, '3', 'Mathelème', 'Univ', 1),
(30, NULL, NULL, '3', 'Mathelème', 'Secondaire', 1);

-- --------------------------------------------------------

--
-- Structure de la table `password_resets`
--

DROP TABLE IF EXISTS `password_resets`;
CREATE TABLE IF NOT EXISTS `password_resets` (
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  KEY `password_resets_email_index` (`email`(250))
) ENGINE=MyISAM DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Structure de la table `payment_groupes_eleves`
--

DROP TABLE IF EXISTS `payment_groupes_eleves`;
CREATE TABLE IF NOT EXISTS `payment_groupes_eleves` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `id_groupe` bigint(20) UNSIGNED NOT NULL,
  `id_eleve` bigint(20) UNSIGNED NOT NULL,
  `num_seance` bigint(20) UNSIGNED NOT NULL,
  `payement` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `num_mois` int(11) NOT NULL DEFAULT 1,
  `exoneree` int(11) NOT NULL DEFAULT 0,
  PRIMARY KEY (`id`),
  KEY `payment_groupes_eleves_id_groupe_foreign` (`id_groupe`),
  KEY `payment_groupes_eleves_id_eleve_foreign` (`id_eleve`)
) ENGINE=MyISAM AUTO_INCREMENT=256 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `payment_groupes_eleves`
--

INSERT INTO `payment_groupes_eleves` (`id`, `id_groupe`, `id_eleve`, `num_seance`, `payement`, `created_at`, `num_mois`, `exoneree`) VALUES
(1, 1, 97, 1, '3000', '2021-07-25 11:15:25', 1, 0),
(2, 1, 98, 1, '2000', '2021-07-25 11:15:41', 1, 0),
(3, 1, 99, 1, '1500', '2021-07-25 11:16:28', 1, 0),
(4, 1, 97, 1, '0', '2021-07-25 11:18:03', 1, 0),
(5, 1, 98, 1, '0', '2021-07-25 11:18:04', 1, 0),
(6, 1, 99, 1, '0', '2021-07-25 11:18:05', 1, 0),
(7, 1, 97, 2, '0', '2021-07-25 11:19:26', 1, 0),
(8, 1, 98, 2, '0', '2021-07-25 11:19:28', 1, 0),
(9, 1, 99, 2, '0', '2021-07-25 11:19:31', 1, 0),
(10, 1, 97, 3, '0', '2021-07-25 11:21:57', 1, 0),
(11, 1, 98, 3, '1000', '2021-07-25 11:22:00', 1, 0),
(12, 1, 99, 3, '0', '2021-07-25 11:22:02', 1, 0),
(13, 1, 97, 4, '0', '2021-07-25 11:33:10', 1, 0),
(14, 1, 98, 4, '0', '2021-07-25 11:33:12', 1, 0),
(15, 1, 99, 4, '0', '2021-07-25 11:33:15', 1, 0),
(16, 1, 97, 5, '2000', '2021-07-25 11:36:13', 2, 0),
(17, 1, 98, 5, '1500', '2021-07-25 11:36:16', 2, 0),
(18, 1, 99, 5, '1600', '2021-07-25 11:36:18', 2, 0),
(19, 1, 97, 6, '1000', '2021-07-25 11:37:48', 2, 0),
(20, 1, 98, 6, '1500', '2021-07-25 11:37:51', 2, 0),
(21, 1, 99, 6, '1000', '2021-07-25 11:37:53', 2, 0),
(22, 1, 97, 7, '0', '2021-07-25 11:38:29', 2, 0),
(23, 1, 98, 7, '0', '2021-07-25 11:38:31', 2, 0),
(24, 1, 99, 7, '100', '2021-07-25 11:38:34', 2, 0),
(25, 1, 97, 8, '0', '2021-07-25 12:39:28', 3, 0),
(26, 1, 98, 8, '0', '2021-07-25 12:39:31', 3, 0),
(27, 1, 99, 8, '0', '2021-07-25 12:39:33', 3, 0),
(28, 1, 97, 9, '1000', '2021-07-25 12:40:31', 3, 0),
(29, 1, 98, 9, '2000', '2021-07-25 12:40:34', 3, 0),
(30, 1, 99, 9, '1500', '2021-07-25 12:40:36', 3, 0),
(31, 1, 97, 10, '2000', '2021-07-25 12:41:30', 3, 0),
(32, 1, 98, 10, '1000', '2021-07-25 12:41:33', 3, 0),
(33, 1, 99, 10, '1400', '2021-07-25 12:41:36', 3, 0),
(34, 1, 97, 11, '0', '2021-07-25 12:41:57', 3, 0),
(35, 1, 98, 11, '0', '2021-07-25 12:42:00', 3, 0),
(36, 1, 99, 11, '100', '2021-07-25 12:42:02', 3, 0),
(37, 1, 97, 12, '0', '2021-07-25 12:42:19', 4, 0),
(38, 1, 98, 12, '0', '2021-07-25 12:42:22', 4, 0),
(39, 1, 99, 12, '0', '2021-07-25 12:42:24', 4, 0),
(40, 1, 97, 13, '3000', '2021-07-25 12:42:51', 4, 0),
(41, 1, 98, 13, '3000', '2021-07-25 12:42:53', 4, 0),
(42, 1, 99, 13, '3000', '2021-07-25 12:42:56', 4, 0),
(43, 1, 97, 14, '0', '2021-07-25 12:46:00', 4, 0),
(44, 1, 98, 14, '0', '2021-07-25 12:46:02', 4, 0),
(45, 1, 99, 14, '0', '2021-07-25 12:46:05', 4, 0),
(46, 1, 97, 15, '0', '2021-07-25 12:47:17', 4, 0),
(47, 1, 98, 15, '0', '2021-07-25 12:47:17', 4, 0),
(48, 1, 99, 15, '0', '2021-07-25 12:47:17', 4, 0),
(49, 1, 97, 16, '0', '2021-07-25 12:47:27', 5, 0),
(50, 1, 98, 16, '0', '2021-07-25 12:47:27', 5, 0),
(51, 1, 99, 16, '0', '2021-07-25 12:47:27', 5, 0),
(52, 1, 97, 17, '1000', '2021-07-25 12:47:52', 5, 0),
(53, 1, 98, 17, '2000', '2021-07-25 12:47:52', 5, 0),
(54, 1, 99, 17, '1500', '2021-07-25 12:47:52', 5, 0),
(55, 1, 97, 18, '2000', '2021-07-25 12:48:21', 5, 0),
(56, 1, 98, 18, '1000', '2021-07-25 12:48:21', 5, 0),
(57, 1, 99, 18, '1500', '2021-07-25 12:48:21', 5, 0),
(58, 1, 97, 19, '0', '2021-07-25 12:48:35', 5, 0),
(59, 1, 98, 19, '0', '2021-07-25 12:48:35', 5, 0),
(60, 1, 99, 19, '0', '2021-07-25 12:48:35', 5, 0),
(61, 1, 97, 20, '0', '2021-07-25 12:48:48', 6, 0),
(62, 1, 98, 20, '0', '2021-07-25 12:48:48', 6, 0),
(63, 1, 99, 20, '0', '2021-07-25 12:48:48', 6, 0),
(64, 1, 97, 21, '3000', '2021-07-25 12:50:21', 6, 0),
(65, 1, 98, 21, '2000', '2021-07-25 12:50:21', 6, 0),
(66, 1, 99, 21, '3000', '2021-07-25 12:50:21', 6, 0),
(67, 1, 97, 22, '0', '2021-07-25 12:50:41', 6, 0),
(68, 1, 98, 22, '100', '2021-07-25 12:50:41', 6, 0),
(69, 1, 99, 22, '0', '2021-07-25 12:50:41', 6, 0),
(70, 1, 97, 23, '0', '2021-07-25 12:51:04', 6, 0),
(71, 1, 98, 23, '900', '2021-07-25 12:51:04', 6, 0),
(72, 1, 99, 23, '0', '2021-07-25 12:51:04', 6, 0),
(73, 1, 97, 24, '0', '2021-07-25 12:52:18', 7, 1),
(74, 1, 98, 24, '0', '2021-07-25 12:52:18', 7, 1),
(75, 1, 99, 24, '0', '2021-07-25 12:52:18', 7, 0),
(76, 1, 97, 25, '0', '2021-07-25 13:26:14', 7, 1),
(77, 1, 98, 25, '0', '2021-07-25 13:26:14', 7, 1),
(78, 1, 99, 25, '0', '2021-07-25 13:26:14', 7, 0),
(79, 1, 97, 26, '0', '2021-07-25 13:26:27', 7, 1),
(80, 1, 98, 26, '0', '2021-07-25 13:26:27', 7, 1),
(81, 1, 99, 26, '0', '2021-07-25 13:26:27', 7, 0),
(82, 1, 97, 27, '0', '2021-07-25 13:26:39', 7, 1),
(83, 1, 98, 27, '0', '2021-07-25 13:26:39', 7, 1),
(84, 1, 99, 27, '0', '2021-07-25 13:26:39', 7, 0),
(85, 1, 97, 28, '0', '2021-07-25 13:26:51', 8, 0),
(86, 1, 98, 28, '0', '2021-07-25 13:26:51', 8, 0),
(87, 1, 99, 28, '0', '2021-07-25 13:26:51', 8, 0),
(88, 1, 97, 29, '2000', '2021-07-25 13:29:28', 8, 0),
(89, 1, 98, 29, '2000', '2021-07-25 13:29:28', 8, 0),
(90, 1, 99, 29, '1700', '2021-07-25 13:29:28', 8, 0),
(91, 1, 97, 30, '1000', '2021-07-25 13:29:58', 8, 0),
(92, 1, 98, 30, '1000', '2021-07-25 13:29:58', 8, 0),
(93, 1, 99, 30, '1300', '2021-07-25 13:29:58', 8, 0),
(94, 1, 97, 31, '0', '2021-07-25 13:31:19', 8, 0),
(95, 1, 98, 31, '0', '2021-07-25 13:31:19', 8, 0),
(96, 1, 99, 31, '0', '2021-07-25 13:31:19', 8, 0),
(97, 1, 97, 32, '0', '2021-07-25 13:31:34', 9, 0),
(98, 1, 98, 32, '0', '2021-07-25 13:31:34', 9, 0),
(99, 1, 99, 32, '0', '2021-07-25 13:31:34', 9, 0),
(100, 1, 97, 33, '0', '2021-07-25 13:33:42', 9, 0),
(101, 1, 98, 33, '0', '2021-07-25 13:33:42', 9, 0),
(102, 1, 99, 33, '0', '2021-07-25 13:33:42', 9, 0),
(103, 1, 97, 34, '2500', '2021-07-25 13:34:09', 9, 0),
(104, 1, 98, 34, '2000', '2021-07-25 13:34:09', 9, 0),
(105, 1, 99, 34, '2600', '2021-07-25 13:34:09', 9, 0),
(106, 1, 97, 35, '500', '2021-07-25 13:34:48', 9, 0),
(107, 1, 98, 35, '1000', '2021-07-25 13:34:48', 9, 0),
(108, 1, 99, 35, '400', '2021-07-25 13:34:48', 9, 0),
(109, 1, 97, 36, '0', '2021-07-25 13:46:02', 10, 0),
(110, 1, 98, 36, '0', '2021-07-25 13:46:02', 10, 0),
(111, 1, 99, 36, '0', '2021-07-25 13:46:02', 10, 0),
(112, 1, 97, 37, '3000', '2021-07-25 13:47:24', 10, 0),
(113, 1, 98, 37, '3000', '2021-07-25 13:47:24', 10, 0),
(114, 1, 99, 37, '3000', '2021-07-25 13:47:24', 10, 0),
(115, 1, 97, 38, '0', '2021-07-25 15:44:33', 10, 0),
(116, 1, 98, 38, '0', '2021-07-25 15:44:33', 10, 0),
(117, 1, 99, 38, '0', '2021-07-25 15:44:33', 10, 0),
(118, 1, 97, 39, '0', '2021-07-25 15:45:26', 10, 0),
(119, 1, 98, 39, '0', '2021-07-25 15:45:26', 10, 0),
(120, 1, 99, 39, '0', '2021-07-25 15:45:26', 10, 0),
(121, 1, 97, 40, '0', '2021-07-25 15:45:36', 11, 1),
(122, 1, 98, 40, '0', '2021-07-25 15:45:36', 11, 1),
(123, 1, 99, 40, '0', '2021-07-25 15:45:36', 11, 0),
(124, 1, 97, 41, '1000', '2021-07-25 15:45:59', 11, 1),
(125, 1, 98, 41, '2000', '2021-07-25 15:45:59', 11, 1),
(126, 1, 99, 41, '1600', '2021-07-25 15:45:59', 11, 0),
(127, 1, 97, 42, '0', '2021-07-25 15:46:11', 11, 1),
(128, 1, 98, 42, '0', '2021-07-25 15:46:11', 11, 1),
(129, 1, 99, 42, '0', '2021-07-25 15:46:11', 11, 0),
(130, 1, 97, 43, '0', '2021-07-25 15:46:23', 11, 1),
(131, 1, 98, 43, '0', '2021-07-25 15:46:23', 11, 1),
(132, 1, 99, 43, '0', '2021-07-25 15:46:23', 11, 0),
(133, 1, 97, 44, '0', '2021-07-25 15:46:41', 12, 0),
(134, 1, 98, 44, '0', '2021-07-25 15:46:41', 12, 0),
(135, 1, 99, 44, '0', '2021-07-25 15:46:41', 12, 0),
(136, 1, 97, 45, '3000', '2021-07-25 15:48:41', 12, 0),
(137, 1, 98, 45, '2000', '2021-07-25 15:48:41', 12, 0),
(138, 1, 99, 45, '1900', '2021-07-25 15:48:41', 12, 0),
(139, 1, 97, 46, '0', '2021-07-25 15:55:08', 12, 0),
(140, 1, 98, 46, '1000', '2021-07-25 15:55:08', 12, 0),
(141, 1, 99, 46, '0', '2021-07-25 15:55:08', 12, 0),
(142, 1, 97, 47, '0', '2021-07-25 15:55:40', 12, 0),
(143, 1, 98, 47, '0', '2021-07-25 15:55:40', 12, 0),
(144, 1, 99, 47, '1100', '2021-07-25 15:55:40', 12, 0),
(145, 1, 97, 48, '0', '2021-07-25 16:01:48', 13, 0),
(146, 1, 98, 48, '0', '2021-07-25 16:01:48', 13, 0),
(147, 1, 99, 48, '0', '2021-07-25 16:01:48', 13, 0),
(148, 2, 100, 1, '2000', '2021-07-25 16:03:34', 1, 0),
(149, 2, 100, 1, '0', '2021-07-25 16:03:58', 1, 0),
(150, 2, 101, 2, '1500', '2021-07-25 16:04:16', 1, 1),
(151, 2, 100, 2, '0', '2021-07-25 16:04:32', 1, 0),
(152, 2, 101, 2, '0', '2021-07-25 16:04:32', 1, 1),
(153, 2, 100, 3, '0', '2021-07-25 16:04:38', 1, 0),
(154, 2, 101, 3, '0', '2021-07-25 16:04:38', 1, 1),
(155, 2, 100, 4, '0', '2021-07-25 16:04:49', 2, 0),
(156, 2, 101, 4, '0', '2021-07-25 16:04:49', 2, 0),
(157, 2, 100, 5, '2000', '2021-07-25 16:06:13', 2, 0),
(158, 2, 101, 5, '2000', '2021-07-25 16:06:13', 2, 0),
(159, 2, 100, 6, '0', '2021-07-25 16:09:20', 2, 0),
(160, 2, 101, 6, '0', '2021-07-25 16:09:20', 2, 0),
(161, 2, 100, 7, '0', '2021-07-25 16:09:29', 2, 0),
(162, 2, 101, 7, '0', '2021-07-25 16:09:29', 2, 0),
(163, 2, 100, 8, '0', '2021-07-25 16:09:37', 3, 0),
(164, 2, 101, 8, '0', '2021-07-25 16:09:37', 3, 0),
(165, 2, 100, 9, '2000', '2021-07-25 16:11:15', 3, 0),
(166, 2, 101, 9, '2000', '2021-07-25 16:11:15', 3, 0),
(167, 2, 100, 10, '0', '2021-07-25 16:11:24', 3, 0),
(168, 2, 101, 10, '0', '2021-07-25 16:11:24', 3, 0),
(169, 2, 100, 11, '0', '2021-07-25 16:11:31', 3, 0),
(170, 2, 101, 11, '0', '2021-07-25 16:11:31', 3, 0),
(171, 2, 100, 12, '0', '2021-07-25 16:11:37', 4, 0),
(172, 2, 101, 12, '0', '2021-07-25 16:11:37', 4, 0),
(173, 2, 100, 13, '2000', '2021-07-25 22:11:09', 4, 0),
(174, 2, 101, 13, '2000', '2021-07-25 22:11:09', 4, 0),
(175, 2, 100, 14, '0', '2021-07-26 00:10:31', 4, 0),
(176, 2, 101, 14, '0', '2021-07-26 00:10:31', 4, 0),
(177, 2, 100, 15, '0', '2021-07-26 00:10:38', 4, 0),
(178, 2, 101, 15, '0', '2021-07-26 00:10:38', 4, 0),
(179, 2, 100, 16, '0', '2021-07-26 00:12:50', 5, 0),
(180, 2, 101, 16, '0', '2021-07-26 00:12:50', 5, 0),
(181, 2, 100, 17, '1000', '2021-07-26 00:45:09', 5, 0),
(182, 2, 101, 17, '1000', '2021-07-26 00:45:09', 5, 0),
(183, 2, 100, 18, '500', '2021-07-26 00:45:33', 5, 0),
(184, 2, 101, 18, '500', '2021-07-26 00:45:33', 5, 0),
(185, 2, 100, 19, '500', '2021-07-26 00:45:53', 5, 0),
(186, 2, 101, 19, '500', '2021-07-26 00:45:53', 5, 0),
(187, 2, 100, 20, '0', '2021-07-26 00:46:30', 6, 0),
(188, 2, 101, 20, '0', '2021-07-26 00:46:30', 6, 0),
(189, 2, 100, 21, '2000', '2021-07-26 15:37:13', 6, 0),
(190, 2, 101, 21, '2000', '2021-07-26 15:37:13', 6, 0),
(191, 2, 100, 22, '0', '2021-07-26 15:37:19', 6, 0),
(192, 2, 101, 22, '0', '2021-07-26 15:37:19', 6, 0),
(193, 2, 100, 23, '0', '2021-07-26 15:37:25', 6, 0),
(194, 2, 101, 23, '0', '2021-07-26 15:37:25', 6, 0),
(195, 2, 100, 24, '0', '2021-07-26 15:37:30', 7, 1),
(196, 2, 101, 24, '0', '2021-07-26 15:37:30', 7, 1),
(197, 2, 100, 25, '1500', '2021-07-26 15:39:01', 7, 1),
(198, 2, 101, 25, '1500', '2021-07-26 15:39:01', 7, 1),
(199, 2, 100, 26, '0', '2021-07-26 15:39:06', 7, 1),
(200, 2, 101, 26, '0', '2021-07-26 15:39:06', 7, 1),
(201, 2, 100, 27, '0', '2021-07-26 15:39:13', 7, 1),
(202, 2, 101, 27, '0', '2021-07-26 15:39:13', 7, 1),
(203, 2, 100, 28, '0', '2021-07-26 15:39:20', 8, 0),
(204, 2, 101, 28, '0', '2021-07-26 15:39:20', 8, 0),
(205, 3, 102, 1, '2000', '2021-07-26 19:44:51', 1, 0),
(206, 3, 103, 1, '1500', '2021-07-26 19:45:17', 1, 0),
(207, 3, 102, 1, '0', '2021-07-26 19:45:34', 1, 0),
(208, 3, 103, 1, '0', '2021-07-26 19:45:34', 1, 0),
(209, 3, 102, 2, '0', '2021-07-26 19:45:56', 1, 0),
(210, 3, 103, 2, '500', '2021-07-26 19:45:56', 1, 0),
(211, 3, 102, 3, '0', '2021-07-26 19:46:08', 1, 0),
(212, 3, 103, 3, '0', '2021-07-26 19:46:08', 1, 0),
(213, 3, 102, 4, '0', '2021-07-26 19:46:16', 2, 0),
(214, 3, 103, 4, '0', '2021-07-26 19:46:16', 2, 0),
(215, 3, 102, 5, '2000', '2021-07-26 19:48:06', 2, 0),
(216, 3, 103, 5, '2000', '2021-07-26 19:48:06', 2, 0),
(217, 3, 102, 6, '0', '2021-07-26 19:48:14', 2, 0),
(218, 3, 103, 6, '0', '2021-07-26 19:48:14', 2, 0),
(219, 3, 102, 7, '0', '2021-07-26 19:48:20', 2, 0),
(220, 3, 103, 7, '0', '2021-07-26 19:48:20', 2, 0),
(221, 3, 102, 8, '0', '2021-07-26 19:48:23', 3, 1),
(222, 3, 103, 8, '0', '2021-07-26 19:48:23', 3, 0),
(223, 3, 102, 9, '1500', '2021-07-26 19:52:07', 3, 1),
(224, 3, 103, 9, '1500', '2021-07-26 19:52:07', 3, 0),
(225, 3, 102, 10, '0', '2021-07-26 19:52:13', 3, 1),
(226, 3, 103, 10, '0', '2021-07-26 19:52:13', 3, 0),
(227, 3, 102, 11, '0', '2021-07-26 19:52:18', 3, 1),
(228, 3, 103, 11, '0', '2021-07-26 19:52:18', 3, 0),
(229, 3, 102, 12, '0', '2021-07-26 19:52:23', 4, 0),
(230, 3, 103, 12, '0', '2021-07-26 19:52:23', 4, 0),
(231, 3, 103, 13, '500', '2021-07-26 20:46:07', 3, 0),
(232, 3, 102, 13, '200', '2021-07-26 20:47:41', 3, 1),
(233, 3, 102, 13, '100', '2021-07-26 20:47:51', 3, 1),
(234, 3, 102, 13, '100', '2021-07-26 20:48:07', 3, 1),
(235, 3, 102, 13, '1000', '2021-07-26 20:52:51', 4, 0),
(236, 3, 103, 13, '1000', '2021-07-26 20:52:51', 4, 0),
(237, 3, 102, 14, '0', '2021-07-26 20:53:04', 4, 0),
(238, 3, 103, 14, '0', '2021-07-26 20:53:04', 4, 0),
(239, 3, 102, 15, '0', '2021-07-26 20:53:27', 4, 0),
(240, 3, 103, 15, '0', '2021-07-26 20:53:27', 4, 0),
(241, 3, 102, 16, '0', '2021-07-26 20:53:32', 5, 1),
(242, 3, 103, 16, '0', '2021-07-26 20:53:32', 5, 0),
(243, 3, 102, 17, '0', '2021-07-26 20:53:50', 5, 1),
(244, 3, 103, 17, '0', '2021-07-26 20:53:50', 5, 0),
(245, 3, 102, 18, '0', '2021-07-26 20:53:56', 5, 1),
(246, 3, 103, 18, '0', '2021-07-26 20:53:56', 5, 0),
(247, 3, 102, 19, '0', '2021-07-26 20:54:02', 5, 1),
(248, 3, 103, 19, '0', '2021-07-26 20:54:02', 5, 0),
(249, 3, 102, 20, '0', '2021-07-26 20:54:09', 6, 0),
(250, 3, 103, 20, '0', '2021-07-26 20:54:09', 6, 0),
(251, 3, 102, 21, '1000', '2021-07-26 20:57:28', 4, 0),
(252, 3, 102, 21, '1000', '2021-07-26 20:57:51', 5, 1),
(253, 3, 102, 21, '500', '2021-07-26 20:58:08', 5, 1),
(254, 3, 103, 21, '1000', '2021-07-26 21:03:09', 4, 0),
(255, 3, 103, 21, '2000', '2021-07-26 21:03:15', 5, 0);

-- --------------------------------------------------------

--
-- Structure de la table `profs`
--

DROP TABLE IF EXISTS `profs`;
CREATE TABLE IF NOT EXISTS `profs` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `nom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `prenom` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `cycle` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL,
  `visible` int(11) NOT NULL DEFAULT 1,
  `tel` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `matiere` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=18 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `profs`
--

INSERT INTO `profs` (`id`, `nom`, `prenom`, `cycle`, `created_at`, `updated_at`, `visible`, `tel`, `matiere`) VALUES
(1, 'Ghezal', 'Lotfi', 'Secondaire', '2021-07-21 22:00:00', NULL, 1, '0557015466', 'Math'),
(2, 'Belarbi', 'Smail', 'Secondaire', '2021-07-25 22:00:00', NULL, 1, '0551859883', 'Physique'),
(4, 'Mestfaoui', 'Wail', 'Moyen', '2021-07-10 22:00:00', NULL, 1, '0551859882', 'Math'),
(6, 'Kadri', 'Ilyes', 'Secondaire', '2021-06-30 22:00:00', NULL, 1, '0543212347', 'Arabe'),
(5, 'Salhi', 'ALI-Haider', 'Univairsitaire', '2021-07-27 22:00:00', NULL, 1, '0786543244', 'Anglais'),
(7, 'Kamel', 'zaoui', 'Secondaire', '2021-07-03 14:26:02', NULL, 1, '0786543212', 'Arabe'),
(13, 'Mechouari', 'Meriem', 'Secondaire', '2021-07-10 15:22:38', NULL, 1, '0553215678', 'Science'),
(17, 'Oulebcir', 'Kamel', 'Secondaire', '2021-07-25 16:23:38', NULL, 1, '0776509812', 'Développement Web'),
(14, 'Chetoui', 'Messoud', 'Secondaire', '2021-07-10 15:23:22', NULL, 1, '0767543212', 'Arabe'),
(15, 'Boufetta', 'Hamid', 'Secondaire', '2021-07-10 15:24:20', NULL, 1, '0765984320', 'Physique'),
(16, 'Bouhila', 'Rachid', 'Secondaire', '2021-07-10 15:25:12', NULL, 1, '0550987656', 'Physique');

-- --------------------------------------------------------

--
-- Structure de la table `seances`
--

DROP TABLE IF EXISTS `seances`;
CREATE TABLE IF NOT EXISTS `seances` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `id_groupe` bigint(20) UNSIGNED NOT NULL,
  `num` int(191) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `seances_id_groupe_foreign` (`id_groupe`)
) ENGINE=MyISAM AUTO_INCREMENT=100 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `seances`
--

INSERT INTO `seances` (`id`, `id_groupe`, `num`, `created_at`) VALUES
(1, 1, 1, '2021-07-25 11:14:31'),
(2, 1, 2, '2021-07-25 11:18:03'),
(3, 1, 3, '2021-07-25 11:19:24'),
(4, 1, 4, '2021-07-25 11:21:56'),
(5, 1, 5, '2021-07-25 11:33:08'),
(6, 1, 6, '2021-07-25 11:36:12'),
(7, 1, 7, '2021-07-25 11:37:47'),
(8, 1, 8, '2021-07-25 11:38:27'),
(9, 1, 9, '2021-07-25 12:39:27'),
(10, 1, 10, '2021-07-25 12:40:29'),
(11, 1, 11, '2021-07-25 12:41:29'),
(12, 1, 12, '2021-07-25 12:41:56'),
(13, 1, 13, '2021-07-25 12:42:18'),
(14, 1, 14, '2021-07-25 12:42:49'),
(15, 1, 15, '2021-07-25 12:45:58'),
(16, 1, 16, '2021-07-25 12:47:17'),
(17, 1, 17, '2021-07-25 12:47:27'),
(18, 1, 18, '2021-07-25 12:47:52'),
(19, 1, 19, '2021-07-25 12:48:21'),
(20, 1, 20, '2021-07-25 12:48:35'),
(21, 1, 21, '2021-07-25 12:48:48'),
(22, 1, 22, '2021-07-25 12:50:21'),
(23, 1, 23, '2021-07-25 12:50:41'),
(24, 1, 24, '2021-07-25 12:51:04'),
(25, 1, 25, '2021-07-25 12:52:18'),
(26, 1, 26, '2021-07-25 13:26:14'),
(27, 1, 27, '2021-07-25 13:26:27'),
(28, 1, 28, '2021-07-25 13:26:39'),
(29, 1, 29, '2021-07-25 13:26:51'),
(30, 1, 30, '2021-07-25 13:29:28'),
(31, 1, 31, '2021-07-25 13:29:58'),
(32, 1, 32, '2021-07-25 13:31:19'),
(33, 1, 33, '2021-07-25 13:31:34'),
(34, 1, 34, '2021-07-25 13:33:42'),
(35, 1, 35, '2021-07-25 13:34:09'),
(36, 1, 36, '2021-07-25 13:34:48'),
(37, 1, 37, '2021-07-25 13:46:02'),
(38, 1, 38, '2021-07-25 13:47:24'),
(39, 1, 39, '2021-07-25 15:44:33'),
(40, 1, 40, '2021-07-25 15:45:26'),
(41, 1, 41, '2021-07-25 15:45:36'),
(42, 1, 42, '2021-07-25 15:45:59'),
(43, 1, 43, '2021-07-25 15:46:11'),
(44, 1, 44, '2021-07-25 15:46:23'),
(45, 1, 45, '2021-07-25 15:46:41'),
(46, 1, 46, '2021-07-25 15:48:41'),
(47, 1, 47, '2021-07-25 15:55:08'),
(48, 1, 48, '2021-07-25 15:55:40'),
(49, 1, 49, '2021-07-25 16:01:48'),
(50, 2, 1, '2021-07-25 16:03:03'),
(51, 2, 2, '2021-07-25 16:03:58'),
(52, 2, 3, '2021-07-25 16:04:32'),
(53, 2, 4, '2021-07-25 16:04:38'),
(54, 2, 5, '2021-07-25 16:04:49'),
(55, 2, 6, '2021-07-25 16:06:13'),
(56, 2, 7, '2021-07-25 16:09:20'),
(57, 2, 8, '2021-07-25 16:09:29'),
(58, 2, 9, '2021-07-25 16:09:37'),
(59, 2, 10, '2021-07-25 16:11:15'),
(60, 2, 11, '2021-07-25 16:11:23'),
(61, 2, 12, '2021-07-25 16:11:31'),
(62, 2, 13, '2021-07-25 16:11:37'),
(63, 2, 14, '2021-07-25 22:11:09'),
(64, 2, 15, '2021-07-26 00:10:31'),
(65, 2, 16, '2021-07-26 00:10:38'),
(66, 2, 17, '2021-07-26 00:12:50'),
(67, 2, 18, '2021-07-26 00:45:09'),
(68, 2, 19, '2021-07-26 00:45:33'),
(69, 2, 20, '2021-07-26 00:45:53'),
(70, 2, 21, '2021-07-26 00:46:30'),
(71, 2, 22, '2021-07-26 15:37:13'),
(72, 2, 23, '2021-07-26 15:37:19'),
(73, 2, 24, '2021-07-26 15:37:25'),
(74, 2, 25, '2021-07-26 15:37:30'),
(75, 2, 26, '2021-07-26 15:39:01'),
(76, 2, 27, '2021-07-26 15:39:06'),
(77, 2, 28, '2021-07-26 15:39:13'),
(78, 2, 29, '2021-07-26 15:39:20'),
(79, 3, 1, '2021-07-26 19:44:03'),
(80, 3, 2, '2021-07-26 19:45:34'),
(81, 3, 3, '2021-07-26 19:45:56'),
(82, 3, 4, '2021-07-26 19:46:08'),
(83, 3, 5, '2021-07-26 19:46:16'),
(84, 3, 6, '2021-07-26 19:48:06'),
(85, 3, 7, '2021-07-26 19:48:14'),
(86, 3, 8, '2021-07-26 19:48:20'),
(87, 3, 9, '2021-07-26 19:48:23'),
(88, 3, 10, '2021-07-26 19:52:07'),
(89, 3, 11, '2021-07-26 19:52:13'),
(90, 3, 12, '2021-07-26 19:52:18'),
(91, 3, 13, '2021-07-26 19:52:23'),
(92, 3, 14, '2021-07-26 20:52:51'),
(93, 3, 15, '2021-07-26 20:53:04'),
(94, 3, 16, '2021-07-26 20:53:27'),
(95, 3, 17, '2021-07-26 20:53:32'),
(96, 3, 18, '2021-07-26 20:53:50'),
(97, 3, 19, '2021-07-26 20:53:56'),
(98, 3, 20, '2021-07-26 20:54:02'),
(99, 3, 21, '2021-07-26 20:54:09');

-- --------------------------------------------------------

--
-- Structure de la table `seances_eleves`
--

DROP TABLE IF EXISTS `seances_eleves`;
CREATE TABLE IF NOT EXISTS `seances_eleves` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `num_seance` int(191) NOT NULL,
  `paye` tinyint(1) NOT NULL,
  `payement` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `presence` tinyint(1) NOT NULL DEFAULT 0,
  `id_seance` bigint(20) UNSIGNED NOT NULL,
  `id_eleve` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  PRIMARY KEY (`id`),
  KEY `seances_eleves_id_seance_foreign` (`id_seance`),
  KEY `seances_eleves_id_eleve_foreign` (`id_eleve`)
) ENGINE=MyISAM AUTO_INCREMENT=247 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `seances_eleves`
--

INSERT INTO `seances_eleves` (`id`, `num_seance`, `paye`, `payement`, `presence`, `id_seance`, `id_eleve`, `created_at`) VALUES
(1, 1, 1, '3000', 0, 1, 97, '2021-07-25 11:15:25'),
(2, 1, 1, '2000', 0, 1, 98, '2021-07-25 11:15:41'),
(3, 1, 1, '1500', 0, 1, 99, '2021-07-25 11:16:28'),
(4, 2, 1, '2000', 0, 2, 97, '2021-07-25 11:18:03'),
(5, 2, 1, '2000', 0, 2, 98, '2021-07-25 11:18:03'),
(6, 2, 1, '2000', 0, 2, 99, '2021-07-25 11:18:04'),
(7, 3, 1, '2000', 0, 3, 97, '2021-07-25 11:19:25'),
(8, 3, 1, '2000', 0, 3, 98, '2021-07-25 11:19:28'),
(9, 3, 1, '2000', 0, 3, 99, '2021-07-25 11:19:30'),
(10, 4, 1, '2000', 1, 4, 97, '2021-07-25 11:21:57'),
(11, 4, 1, '2000', 1, 4, 98, '2021-07-25 11:21:59'),
(12, 4, 1, '2000', 1, 4, 99, '2021-07-25 11:22:02'),
(13, 5, 1, '2000', 1, 5, 97, '2021-07-25 11:33:09'),
(14, 5, 1, '2000', 1, 5, 98, '2021-07-25 11:33:12'),
(15, 5, 1, '2000', 1, 5, 99, '2021-07-25 11:33:14'),
(16, 6, 1, '2000', 0, 6, 97, '2021-07-25 11:36:13'),
(17, 6, 1, '2000', 0, 6, 98, '2021-07-25 11:36:15'),
(18, 6, 1, '2000', 0, 6, 99, '2021-07-25 11:36:18'),
(19, 7, 1, '2000', 0, 7, 97, '2021-07-25 11:37:48'),
(20, 7, 1, '2000', 0, 7, 98, '2021-07-25 11:37:50'),
(21, 7, 1, '2000', 0, 7, 99, '2021-07-25 11:37:53'),
(22, 8, 1, '2000', 1, 8, 97, '2021-07-25 11:38:28'),
(23, 8, 1, '2000', 1, 8, 98, '2021-07-25 11:38:31'),
(24, 8, 1, '2000', 1, 8, 99, '2021-07-25 11:38:34'),
(25, 9, 1, '2000', 1, 9, 97, '2021-07-25 12:39:28'),
(26, 9, 1, '2000', 1, 9, 98, '2021-07-25 12:39:30'),
(27, 9, 1, '2000', 1, 9, 99, '2021-07-25 12:39:33'),
(28, 10, 1, '2000', 1, 10, 97, '2021-07-25 12:40:31'),
(29, 10, 1, '2000', 1, 10, 98, '2021-07-25 12:40:33'),
(30, 10, 1, '2000', 1, 10, 99, '2021-07-25 12:40:36'),
(31, 11, 1, '2000', 1, 11, 97, '2021-07-25 12:41:30'),
(32, 11, 1, '2000', 1, 11, 98, '2021-07-25 12:41:33'),
(33, 11, 1, '2000', 1, 11, 99, '2021-07-25 12:41:35'),
(34, 12, 1, '2000', 1, 12, 97, '2021-07-25 12:41:57'),
(35, 12, 1, '2000', 1, 12, 98, '2021-07-25 12:41:59'),
(36, 12, 1, '2000', 1, 12, 99, '2021-07-25 12:42:02'),
(37, 13, 1, '2000', 0, 13, 97, '2021-07-25 12:42:19'),
(38, 13, 1, '2000', 0, 13, 98, '2021-07-25 12:42:21'),
(39, 13, 1, '2000', 0, 13, 99, '2021-07-25 12:42:24'),
(40, 14, 1, '2000', 1, 14, 97, '2021-07-25 12:42:50'),
(41, 14, 1, '2000', 1, 14, 98, '2021-07-25 12:42:53'),
(42, 14, 1, '2000', 1, 14, 99, '2021-07-25 12:42:55'),
(43, 15, 1, '2000', 1, 15, 97, '2021-07-25 12:45:59'),
(44, 15, 1, '2000', 1, 15, 98, '2021-07-25 12:46:02'),
(45, 15, 1, '2000', 1, 15, 99, '2021-07-25 12:46:04'),
(46, 16, 1, '2000', 1, 16, 97, '2021-07-25 12:47:17'),
(47, 16, 1, '2000', 1, 16, 98, '2021-07-25 12:47:17'),
(48, 16, 1, '2000', 1, 16, 99, '2021-07-25 12:47:17'),
(49, 17, 1, '2000', 1, 17, 97, '2021-07-25 12:47:27'),
(50, 17, 1, '2000', 1, 17, 98, '2021-07-25 12:47:27'),
(51, 17, 1, '2000', 1, 17, 99, '2021-07-25 12:47:27'),
(52, 18, 1, '2000', 1, 18, 97, '2021-07-25 12:47:52'),
(53, 18, 1, '2000', 1, 18, 98, '2021-07-25 12:47:52'),
(54, 18, 1, '2000', 1, 18, 99, '2021-07-25 12:47:52'),
(55, 19, 1, '2000', 1, 19, 97, '2021-07-25 12:48:21'),
(56, 19, 1, '2000', 1, 19, 98, '2021-07-25 12:48:21'),
(57, 19, 1, '2000', 1, 19, 99, '2021-07-25 12:48:21'),
(58, 20, 1, '2000', 1, 20, 97, '2021-07-25 12:48:35'),
(59, 20, 1, '2000', 1, 20, 98, '2021-07-25 12:48:35'),
(60, 20, 1, '2000', 1, 20, 99, '2021-07-25 12:48:35'),
(61, 21, 1, '2000', 1, 21, 97, '2021-07-25 12:48:48'),
(62, 21, 1, '2000', 1, 21, 98, '2021-07-25 12:48:48'),
(63, 21, 1, '2000', 1, 21, 99, '2021-07-25 12:48:48'),
(64, 22, 1, '2000', 1, 22, 97, '2021-07-25 12:50:21'),
(65, 22, 1, '2000', 1, 22, 98, '2021-07-25 12:50:21'),
(66, 22, 1, '2000', 1, 22, 99, '2021-07-25 12:50:21'),
(67, 23, 1, '2000', 1, 23, 97, '2021-07-25 12:50:41'),
(68, 23, 1, '2000', 1, 23, 98, '2021-07-25 12:50:41'),
(69, 23, 1, '2000', 1, 23, 99, '2021-07-25 12:50:41'),
(70, 24, 1, '2000', 1, 24, 97, '2021-07-25 12:51:04'),
(71, 24, 1, '2000', 1, 24, 98, '2021-07-25 12:51:04'),
(72, 24, 1, '2000', 1, 24, 99, '2021-07-25 12:51:04'),
(73, 25, 1, '2000', 1, 25, 97, '2021-07-25 12:52:18'),
(74, 25, 1, '2000', 1, 25, 98, '2021-07-25 12:52:18'),
(75, 25, 1, '2000', 1, 25, 99, '2021-07-25 12:52:18'),
(76, 26, 1, '2000', 1, 26, 97, '2021-07-25 13:26:14'),
(77, 26, 1, '2000', 1, 26, 98, '2021-07-25 13:26:14'),
(78, 26, 1, '2000', 1, 26, 99, '2021-07-25 13:26:14'),
(79, 27, 1, '2000', 1, 27, 97, '2021-07-25 13:26:27'),
(80, 27, 1, '2000', 1, 27, 98, '2021-07-25 13:26:27'),
(81, 27, 1, '2000', 1, 27, 99, '2021-07-25 13:26:27'),
(82, 28, 1, '2000', 1, 28, 97, '2021-07-25 13:26:39'),
(83, 28, 1, '2000', 1, 28, 98, '2021-07-25 13:26:39'),
(84, 28, 1, '2000', 1, 28, 99, '2021-07-25 13:26:39'),
(85, 29, 1, '2000', 1, 29, 97, '2021-07-25 13:26:51'),
(86, 29, 1, '2000', 1, 29, 98, '2021-07-25 13:26:51'),
(87, 29, 1, '2000', 1, 29, 99, '2021-07-25 13:26:51'),
(88, 30, 1, '2000', 0, 30, 97, '2021-07-25 13:29:28'),
(89, 30, 1, '2000', 0, 30, 98, '2021-07-25 13:29:28'),
(90, 30, 1, '2000', 0, 30, 99, '2021-07-25 13:29:28'),
(91, 31, 1, '2000', 1, 31, 97, '2021-07-25 13:29:58'),
(92, 31, 1, '2000', 1, 31, 98, '2021-07-25 13:29:58'),
(93, 31, 1, '2000', 1, 31, 99, '2021-07-25 13:29:58'),
(94, 32, 1, '2000', 1, 32, 97, '2021-07-25 13:31:19'),
(95, 32, 1, '2000', 1, 32, 98, '2021-07-25 13:31:19'),
(96, 32, 1, '2000', 1, 32, 99, '2021-07-25 13:31:19'),
(97, 33, 1, '2000', 1, 33, 97, '2021-07-25 13:31:34'),
(98, 33, 1, '2000', 1, 33, 98, '2021-07-25 13:31:34'),
(99, 33, 1, '2000', 1, 33, 99, '2021-07-25 13:31:34'),
(100, 34, 1, '2000', 0, 34, 97, '2021-07-25 13:33:42'),
(101, 34, 1, '2000', 0, 34, 98, '2021-07-25 13:33:42'),
(102, 34, 1, '2000', 0, 34, 99, '2021-07-25 13:33:42'),
(103, 35, 1, '2000', 1, 35, 97, '2021-07-25 13:34:09'),
(104, 35, 1, '2000', 1, 35, 98, '2021-07-25 13:34:09'),
(105, 35, 1, '2000', 1, 35, 99, '2021-07-25 13:34:09'),
(106, 36, 1, '2000', 1, 36, 97, '2021-07-25 13:34:48'),
(107, 36, 1, '2000', 1, 36, 98, '2021-07-25 13:34:48'),
(108, 36, 1, '2000', 1, 36, 99, '2021-07-25 13:34:48'),
(109, 37, 1, '2000', 1, 37, 97, '2021-07-25 13:46:02'),
(110, 37, 1, '2000', 1, 37, 98, '2021-07-25 13:46:02'),
(111, 37, 1, '2000', 1, 37, 99, '2021-07-25 13:46:02'),
(112, 38, 1, '2000', 1, 38, 97, '2021-07-25 13:47:24'),
(113, 38, 1, '2000', 1, 38, 98, '2021-07-25 13:47:24'),
(114, 38, 1, '2000', 1, 38, 99, '2021-07-25 13:47:24'),
(115, 39, 1, '2000', 1, 39, 97, '2021-07-25 15:44:33'),
(116, 39, 1, '2000', 1, 39, 98, '2021-07-25 15:44:33'),
(117, 39, 1, '2000', 1, 39, 99, '2021-07-25 15:44:33'),
(118, 40, 1, '2000', 1, 40, 97, '2021-07-25 15:45:26'),
(119, 40, 1, '2000', 1, 40, 98, '2021-07-25 15:45:26'),
(120, 40, 1, '2000', 1, 40, 99, '2021-07-25 15:45:26'),
(121, 41, 1, '2000', 1, 41, 97, '2021-07-25 15:45:36'),
(122, 41, 1, '2000', 1, 41, 98, '2021-07-25 15:45:36'),
(123, 41, 1, '2000', 1, 41, 99, '2021-07-25 15:45:36'),
(124, 42, 1, '2000', 1, 42, 97, '2021-07-25 15:45:59'),
(125, 42, 1, '2000', 1, 42, 98, '2021-07-25 15:45:59'),
(126, 42, 1, '2000', 1, 42, 99, '2021-07-25 15:45:59'),
(127, 43, 1, '2000', 1, 43, 97, '2021-07-25 15:46:11'),
(128, 43, 1, '2000', 1, 43, 98, '2021-07-25 15:46:11'),
(129, 43, 1, '2000', 1, 43, 99, '2021-07-25 15:46:11'),
(130, 44, 1, '2000', 1, 44, 97, '2021-07-25 15:46:23'),
(131, 44, 1, '2000', 1, 44, 98, '2021-07-25 15:46:23'),
(132, 44, 1, '2000', 1, 44, 99, '2021-07-25 15:46:23'),
(133, 45, 1, '2000', 0, 45, 97, '2021-07-25 15:46:41'),
(134, 45, 1, '2000', 0, 45, 98, '2021-07-25 15:46:41'),
(135, 45, 1, '2000', 0, 45, 99, '2021-07-25 15:46:41'),
(136, 46, 1, '2000', 1, 46, 97, '2021-07-25 15:48:41'),
(137, 46, 1, '2000', 1, 46, 98, '2021-07-25 15:48:41'),
(138, 46, 1, '2000', 1, 46, 99, '2021-07-25 15:48:41'),
(139, 47, 1, '2000', 1, 47, 97, '2021-07-25 15:55:08'),
(140, 47, 1, '2000', 1, 47, 98, '2021-07-25 15:55:08'),
(141, 47, 1, '2000', 1, 47, 99, '2021-07-25 15:55:08'),
(142, 48, 1, '2000', 1, 48, 97, '2021-07-25 15:55:40'),
(143, 48, 1, '2000', 1, 48, 98, '2021-07-25 15:55:40'),
(144, 48, 1, '2000', 1, 48, 99, '2021-07-25 15:55:40'),
(145, 48, 1, '2000', 0, 49, 97, '2021-07-25 16:01:48'),
(146, 48, 1, '2000', 0, 49, 98, '2021-07-25 16:01:48'),
(147, 48, 1, '2000', 0, 49, 99, '2021-07-25 16:01:48'),
(148, 1, 1, '2000', 1, 50, 100, '2021-07-25 16:03:34'),
(149, 2, 1, '2000', 1, 51, 100, '2021-07-25 16:03:58'),
(150, 1, 1, '1500', 1, 51, 101, '2021-07-25 16:04:16'),
(151, 3, 1, '2000', 1, 52, 100, '2021-07-25 16:04:32'),
(152, 3, 1, '2000', 1, 52, 101, '2021-07-25 16:04:32'),
(153, 4, 1, '2000', 1, 53, 100, '2021-07-25 16:04:38'),
(154, 4, 1, '2000', 1, 53, 101, '2021-07-25 16:04:38'),
(155, 5, 1, '2000', 0, 54, 100, '2021-07-25 16:04:49'),
(156, 5, 1, '2000', 0, 54, 101, '2021-07-25 16:04:49'),
(157, 6, 1, '2000', 1, 55, 100, '2021-07-25 16:06:13'),
(158, 6, 1, '2000', 1, 55, 101, '2021-07-25 16:06:13'),
(159, 7, 1, '2000', 1, 56, 100, '2021-07-25 16:09:20'),
(160, 7, 1, '2000', 1, 56, 101, '2021-07-25 16:09:20'),
(161, 8, 1, '2000', 1, 57, 100, '2021-07-25 16:09:29'),
(162, 8, 1, '2000', 1, 57, 101, '2021-07-25 16:09:29'),
(163, 9, 1, '2000', 0, 58, 100, '2021-07-25 16:09:37'),
(164, 9, 1, '2000', 0, 58, 101, '2021-07-25 16:09:37'),
(165, 10, 1, '2000', 1, 59, 100, '2021-07-25 16:11:15'),
(166, 10, 1, '2000', 1, 59, 101, '2021-07-25 16:11:15'),
(167, 11, 1, '2000', 1, 60, 100, '2021-07-25 16:11:24'),
(168, 11, 1, '2000', 1, 60, 101, '2021-07-25 16:11:24'),
(169, 12, 1, '2000', 1, 61, 100, '2021-07-25 16:11:31'),
(170, 12, 1, '2000', 1, 61, 101, '2021-07-25 16:11:31'),
(171, 13, 1, '2000', 1, 62, 100, '2021-07-25 16:11:37'),
(172, 13, 1, '2000', 1, 62, 101, '2021-07-25 16:11:37'),
(173, 14, 1, '2000', 1, 63, 100, '2021-07-25 22:11:09'),
(174, 14, 1, '2000', 1, 63, 101, '2021-07-25 22:11:09'),
(175, 15, 1, '2000', 1, 64, 100, '2021-07-26 00:10:31'),
(176, 15, 1, '2000', 1, 64, 101, '2021-07-26 00:10:31'),
(177, 16, 1, '2000', 1, 65, 100, '2021-07-26 00:10:38'),
(178, 16, 1, '2000', 1, 65, 101, '2021-07-26 00:10:38'),
(179, 17, 1, '2000', 0, 66, 100, '2021-07-26 00:12:50'),
(180, 17, 1, '2000', 0, 66, 101, '2021-07-26 00:12:50'),
(181, 18, 1, '2000', 1, 67, 100, '2021-07-26 00:45:09'),
(182, 18, 1, '2000', 1, 67, 101, '2021-07-26 00:45:09'),
(183, 19, 1, '2000', 1, 68, 100, '2021-07-26 00:45:33'),
(184, 19, 1, '2000', 1, 68, 101, '2021-07-26 00:45:33'),
(185, 20, 1, '2000', 1, 69, 100, '2021-07-26 00:45:53'),
(186, 20, 1, '2000', 1, 69, 101, '2021-07-26 00:45:53'),
(187, 21, 1, '2000', 0, 70, 100, '2021-07-26 00:46:30'),
(188, 21, 1, '2000', 0, 70, 101, '2021-07-26 00:46:30'),
(189, 22, 1, '2000', 1, 71, 100, '2021-07-26 15:37:13'),
(190, 22, 1, '2000', 0, 71, 101, '2021-07-26 15:37:13'),
(191, 23, 1, '2000', 1, 72, 100, '2021-07-26 15:37:19'),
(192, 23, 1, '2000', 1, 72, 101, '2021-07-26 15:37:19'),
(193, 24, 1, '2000', 1, 73, 100, '2021-07-26 15:37:25'),
(194, 24, 1, '2000', 1, 73, 101, '2021-07-26 15:37:25'),
(195, 25, 1, '2000', 0, 74, 100, '2021-07-26 15:37:30'),
(196, 25, 1, '2000', 0, 74, 101, '2021-07-26 15:37:30'),
(197, 26, 1, '2000', 1, 75, 100, '2021-07-26 15:39:01'),
(198, 26, 1, '2000', 1, 75, 101, '2021-07-26 15:39:01'),
(199, 27, 1, '2000', 1, 76, 100, '2021-07-26 15:39:06'),
(200, 27, 1, '2000', 1, 76, 101, '2021-07-26 15:39:06'),
(201, 28, 1, '2000', 1, 77, 100, '2021-07-26 15:39:13'),
(202, 28, 1, '2000', 1, 77, 101, '2021-07-26 15:39:13'),
(203, 28, 1, '2000', 0, 78, 100, '2021-07-26 15:39:20'),
(204, 28, 1, '2000', 0, 78, 101, '2021-07-26 15:39:20'),
(205, 1, 1, '2000', 1, 79, 102, '2021-07-26 19:44:51'),
(206, 1, 1, '1500', 1, 79, 103, '2021-07-26 19:45:17'),
(207, 2, 1, '2000', 1, 80, 102, '2021-07-26 19:45:34'),
(208, 2, 1, '2000', 1, 80, 103, '2021-07-26 19:45:34'),
(209, 3, 1, '2000', 1, 81, 102, '2021-07-26 19:45:56'),
(210, 3, 1, '2000', 0, 81, 103, '2021-07-26 19:45:56'),
(211, 4, 1, '2000', 1, 82, 102, '2021-07-26 19:46:08'),
(212, 4, 1, '2000', 1, 82, 103, '2021-07-26 19:46:08'),
(213, 5, 1, '2000', 1, 83, 102, '2021-07-26 19:46:16'),
(214, 5, 1, '2000', 1, 83, 103, '2021-07-26 19:46:16'),
(215, 6, 1, '2000', 1, 84, 102, '2021-07-26 19:48:06'),
(216, 6, 1, '2000', 1, 84, 103, '2021-07-26 19:48:06'),
(217, 7, 1, '2000', 1, 85, 102, '2021-07-26 19:48:14'),
(218, 7, 1, '2000', 1, 85, 103, '2021-07-26 19:48:14'),
(219, 8, 1, '2000', 0, 86, 102, '2021-07-26 19:48:20'),
(220, 8, 1, '2000', 0, 86, 103, '2021-07-26 19:48:20'),
(221, 9, 1, '2000', 1, 87, 102, '2021-07-26 19:48:23'),
(222, 9, 1, '2000', 1, 87, 103, '2021-07-26 19:48:23'),
(223, 10, 1, '2000', 1, 88, 102, '2021-07-26 19:52:07'),
(224, 10, 1, '2000', 1, 88, 103, '2021-07-26 19:52:07'),
(225, 11, 1, '2000', 1, 89, 102, '2021-07-26 19:52:13'),
(226, 11, 1, '2000', 1, 89, 103, '2021-07-26 19:52:13'),
(227, 12, 1, '2000', 1, 90, 102, '2021-07-26 19:52:18'),
(228, 12, 1, '2000', 1, 90, 103, '2021-07-26 19:52:18'),
(229, 13, 1, '2000', 0, 91, 102, '2021-07-26 19:52:23'),
(230, 13, 1, '2000', 0, 91, 103, '2021-07-26 19:52:23'),
(231, 14, 1, '2000', 1, 92, 102, '2021-07-26 20:52:51'),
(232, 14, 1, '2000', 1, 92, 103, '2021-07-26 20:52:51'),
(233, 15, 1, '2000', 1, 93, 102, '2021-07-26 20:53:04'),
(234, 15, 1, '2000', 1, 93, 103, '2021-07-26 20:53:04'),
(235, 16, 1, '2000', 1, 94, 102, '2021-07-26 20:53:27'),
(236, 16, 1, '2000', 1, 94, 103, '2021-07-26 20:53:27'),
(237, 17, 1, '2000', 1, 95, 102, '2021-07-26 20:53:32'),
(238, 17, 1, '2000', 1, 95, 103, '2021-07-26 20:53:32'),
(239, 18, 1, '2000', 1, 96, 102, '2021-07-26 20:53:50'),
(240, 18, 1, '2000', 1, 96, 103, '2021-07-26 20:53:50'),
(241, 19, 1, '2000', 1, 97, 102, '2021-07-26 20:53:56'),
(242, 19, 1, '2000', 1, 97, 103, '2021-07-26 20:53:56'),
(243, 20, 1, '2000', 1, 98, 102, '2021-07-26 20:54:02'),
(244, 20, 1, '2000', 1, 98, 103, '2021-07-26 20:54:02'),
(245, 20, 1, '2000', 0, 99, 102, '2021-07-26 20:54:09'),
(246, 20, 1, '2000', 0, 99, 103, '2021-07-26 20:54:09');

-- --------------------------------------------------------

--
-- Structure de la table `users`
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE IF NOT EXISTS `users` (
  `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `lang` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `users_email_unique` (`email`) USING HASH
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Déchargement des données de la table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`, `lang`) VALUES
(1, 'Lotfi Ghezal', 'ghezal.lotfi10@gmail.com', NULL, '$2y$10$eBQzRm1VgLN8jx7NHCL7DuWJQVJtZRXoggLzl41xuiQzvxczVILgO', NULL, '2021-03-16 11:46:45', '2021-07-17 14:51:35', 'en');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
